OpenFOAM_rotatingDrum_velocity_driven/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          2000;
        startFace       117200;
    }
    outlet
    {
        type            patch;
        nFaces          2000;
        startFace       119200;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       121200;
    }
)

// ************************************************************************* //
